Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32U5G9/Includes/Registers/stm32U5Gx_gtzc1_mpcbb2.h
/*
SPDX-License-Identifier: MIT
SPDX-FileCopyrightText: 2025-2026 Edo. Franzi
*/

/*
; stm32U5Gx_gtzc1_mpcbb2.
; =======================

;------------------------------------------------------------------------
; Author:   Generated using the .svd description    The 2025-01-01
; Modifs:
;
; Project:  uKOS-X
; Goal:     stm32U5Gx_gtzc1_mpcbb2 equates.
;
;   (c) 2025-2026, Edo. Franzi
;   --------------------------
;                                              __ ______  _____
;   Edo. Franzi                         __  __/ //_/ __ \/ ___/
;   5-Route de Cheseaux                / / / / ,< / / / /\__ \
;   CH 1400 Cheseaux-Noréaz           / /_/ / /| / /_/ /___/ /
;                                     \__,_/_/ |_\____//____/
;   edo.franzi@ukos.ch
;
;   Description: Lightweight, real-time multitasking operating
;   system for embedded microcontroller and DSP-based systems.
;
;   Permission is hereby granted, free of charge, to any person
;   obtaining a copy of this software and associated documentation
;   files (the "Software"), to deal in the Software without restriction,
;   including without limitation the rights to use, copy, modify,
;   merge, publish, distribute, sublicense, and/or sell copies of the
;   Software, and to permit persons to whom the Software is furnished
;   to do so, subject to the following conditions:
;
;   The above copyright notice and this permission notice shall be
;   included in all copies or substantial portions of the Software.
;
;   THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND,
;   EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF
;   MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND
;   NONINFRINGEMENT. IN NO EVENT SHALL THE AUTHORS OR COPYRIGHT HOLDERS
;   BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER LIABILITY, WHETHER IN AN
;   ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM, OUT OF OR IN
;   CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE
;   SOFTWARE.
;
;------------------------------------------------------------------------
*/

#pragma once

#include    <stdint.h>

// GTZC1_MPCBB2 address definitions
// --------------------------------

typedef struct {
    volatile    uint32_t    CR;
    volatile    uint32_t    RESERVED0[3];
    volatile    uint32_t    CFGLOCK1;
    volatile    uint32_t    CFGLOCK2;
    volatile    uint32_t    RESERVED1[58];
    volatile    uint32_t    SECCFGR0;
    volatile    uint32_t    SECCFGR1;
    volatile    uint32_t    SECCFGR2;
    volatile    uint32_t    SECCFGR3;
    volatile    uint32_t    SECCFGR4;
    volatile    uint32_t    SECCFGR5;
    volatile    uint32_t    SECCFGR6;
    volatile    uint32_t    SECCFGR7;
    volatile    uint32_t    SECCFGR8;
    volatile    uint32_t    SECCFGR9;
    volatile    uint32_t    SECCFGR10;
    volatile    uint32_t    SECCFGR11;
    volatile    uint32_t    SECCFGR12;
    volatile    uint32_t    SECCFGR13;
    volatile    uint32_t    SECCFGR14;
    volatile    uint32_t    SECCFGR15;
    volatile    uint32_t    SECCFGR16;
    volatile    uint32_t    SECCFGR17;
    volatile    uint32_t    SECCFGR18;
    volatile    uint32_t    SECCFGR19;
    volatile    uint32_t    SECCFGR20;
    volatile    uint32_t    SECCFGR21;
    volatile    uint32_t    SECCFGR22;
    volatile    uint32_t    SECCFGR23;
    volatile    uint32_t    SECCFGR24;
    volatile    uint32_t    SECCFGR25;
    volatile    uint32_t    SECCFGR26;
    volatile    uint32_t    SECCFGR27;
    volatile    uint32_t    SECCFGR28;
    volatile    uint32_t    SECCFGR29;
    volatile    uint32_t    SECCFGR30;
    volatile    uint32_t    SECCFGR31;
    volatile    uint32_t    SECCFGR32;
    volatile    uint32_t    SECCFGR33;
    volatile    uint32_t    SECCFGR34;
    volatile    uint32_t    SECCFGR35;
    volatile    uint32_t    SECCFGR36;
    volatile    uint32_t    SECCFGR37;
    volatile    uint32_t    SECCFGR38;
    volatile    uint32_t    SECCFGR39;
    volatile    uint32_t    SECCFGR40;
    volatile    uint32_t    SECCFGR41;
    volatile    uint32_t    SECCFGR42;
    volatile    uint32_t    SECCFGR43;
    volatile    uint32_t    SECCFGR44;
    volatile    uint32_t    SECCFGR45;
    volatile    uint32_t    SECCFGR46;
    volatile    uint32_t    SECCFGR47;
    volatile    uint32_t    SECCFGR48;
    volatile    uint32_t    SECCFGR49;
    volatile    uint32_t    SECCFGR50;
    volatile    uint32_t    SECCFGR51;
    volatile    uint32_t    RESERVED2[12];
    volatile    uint32_t    PRIVCFGR0;
    volatile    uint32_t    PRIVCFGR1;
    volatile    uint32_t    PRIVCFGR2;
    volatile    uint32_t    PRIVCFGR3;
    volatile    uint32_t    PRIVCFGR4;
    volatile    uint32_t    PRIVCFGR5;
    volatile    uint32_t    PRIVCFGR6;
    volatile    uint32_t    PRIVCFGR7;
    volatile    uint32_t    PRIVCFGR8;
    volatile    uint32_t    PRIVCFGR9;
    volatile    uint32_t    PRIVCFGR10;
    volatile    uint32_t    PRIVCFGR11;
    volatile    uint32_t    PRIVCFGR12;
    volatile    uint32_t    PRIVCFGR13;
    volatile    uint32_t    PRIVCFGR14;
    volatile    uint32_t    PRIVCFGR15;
    volatile    uint32_t    PRIVCFGR16;
    volatile    uint32_t    PRIVCFGR17;
    volatile    uint32_t    PRIVCFGR18;
    volatile    uint32_t    PRIVCFGR19;
    volatile    uint32_t    PRIVCFGR20;
    volatile    uint32_t    PRIVCFGR21;
    volatile    uint32_t    PRIVCFGR22;
    volatile    uint32_t    PRIVCFGR23;
    volatile    uint32_t    PRIVCFGR24;
    volatile    uint32_t    PRIVCFGR25;
    volatile    uint32_t    PRIVCFGR26;
    volatile    uint32_t    PRIVCFGR27;
    volatile    uint32_t    PRIVCFGR28;
    volatile    uint32_t    PRIVCFGR29;
    volatile    uint32_t    PRIVCFGR30;
    volatile    uint32_t    PRIVCFGR31;
    volatile    uint32_t    PRIVCFGR32;
    volatile    uint32_t    PRIVCFGR33;
    volatile    uint32_t    PRIVCFGR34;
    volatile    uint32_t    PRIVCFGR35;
    volatile    uint32_t    PRIVCFGR36;
    volatile    uint32_t    PRIVCFGR37;
    volatile    uint32_t    PRIVCFGR38;
    volatile    uint32_t    PRIVCFGR39;
    volatile    uint32_t    PRIVCFGR40;
    volatile    uint32_t    PRIVCFGR41;
    volatile    uint32_t    PRIVCFGR42;
    volatile    uint32_t    PRIVCFGR43;
    volatile    uint32_t    PRIVCFGR44;
    volatile    uint32_t    PRIVCFGR45;
    volatile    uint32_t    PRIVCFGR46;
    volatile    uint32_t    PRIVCFGR47;
    volatile    uint32_t    PRIVCFGR48;
    volatile    uint32_t    PRIVCFGR49;
    volatile    uint32_t    PRIVCFGR50;
    volatile    uint32_t    PRIVCFGR51;
} GTZC1_MPCBB2_TypeDef;

#ifdef __cplusplus
#define GTZC1_MPCBB2_NS reinterpret_cast<GTZC1_MPCBB2_TypeDef *>(0x40033000U)
#define GTZC1_MPCBB2_S  reinterpret_cast<GTZC1_MPCBB2_TypeDef *>(0x50033000U)

#else
#define GTZC1_MPCBB2_NS ((GTZC1_MPCBB2_TypeDef *)0x40033000U)
#define GTZC1_MPCBB2_S  ((GTZC1_MPCBB2_TypeDef *)0x50033000U)
#endif

