Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32U5G9/Includes/Registers/stm32U5Gx_gtzc1_mpcbb2.h
#define GTZC1_MPCBB2_SECCFGR51_SEC31    (0x1U<<31)
#define GTZC1_MPCBB2_SECCFGR51_SEC30    (0x1U<<30)
#define GTZC1_MPCBB2_SECCFGR51_SEC29    (0x1U<<29)
#define GTZC1_MPCBB2_SECCFGR51_SEC28    (0x1U<<28)
#define GTZC1_MPCBB2_SECCFGR51_SEC27    (0x1U<<27)
#define GTZC1_MPCBB2_SECCFGR51_SEC26    (0x1U<<26)
#define GTZC1_MPCBB2_SECCFGR51_SEC25    (0x1U<<25)
#define GTZC1_MPCBB2_SECCFGR51_SEC24    (0x1U<<24)
#define GTZC1_MPCBB2_SECCFGR51_SEC23    (0x1U<<23)
#define GTZC1_MPCBB2_SECCFGR51_SEC22    (0x1U<<22)
#define GTZC1_MPCBB2_SECCFGR51_SEC21    (0x1U<<21)
#define GTZC1_MPCBB2_SECCFGR51_SEC20    (0x1U<<20)
#define GTZC1_MPCBB2_SECCFGR51_SEC19    (0x1U<<19)
#define GTZC1_MPCBB2_SECCFGR51_SEC18    (0x1U<<18)
#define GTZC1_MPCBB2_SECCFGR51_SEC17    (0x1U<<17)
#define GTZC1_MPCBB2_SECCFGR51_SEC16    (0x1U<<16)
#define GTZC1_MPCBB2_SECCFGR51_SEC15    (0x1U<<15)
#define GTZC1_MPCBB2_SECCFGR51_SEC14    (0x1U<<14)
#define GTZC1_MPCBB2_SECCFGR51_SEC13    (0x1U<<13)
#define GTZC1_MPCBB2_SECCFGR51_SEC12    (0x1U<<12)
#define GTZC1_MPCBB2_SECCFGR51_SEC11    (0x1U<<11)
#define GTZC1_MPCBB2_SECCFGR51_SEC10    (0x1U<<10)
#define GTZC1_MPCBB2_SECCFGR51_SEC9     (0x1U<<9)
#define GTZC1_MPCBB2_SECCFGR51_SEC8     (0x1U<<8)
#define GTZC1_MPCBB2_SECCFGR51_SEC7     (0x1U<<7)
#define GTZC1_MPCBB2_SECCFGR51_SEC6     (0x1U<<6)
#define GTZC1_MPCBB2_SECCFGR51_SEC5     (0x1U<<5)
#define GTZC1_MPCBB2_SECCFGR51_SEC4     (0x1U<<4)
#define GTZC1_MPCBB2_SECCFGR51_SEC3     (0x1U<<3)
#define GTZC1_MPCBB2_SECCFGR51_SEC2     (0x1U<<2)
#define GTZC1_MPCBB2_SECCFGR51_SEC1     (0x1U<<1)
#define GTZC1_MPCBB2_SECCFGR51_SEC0     (0x1U<<0)

// PRIVCFGR0 Configuration

#define GTZC1_MPCBB2_PRIVCFGR0_PRIV31   (0x1U<<31)
#define GTZC1_MPCBB2_PRIVCFGR0_PRIV30   (0x1U<<30)
#define GTZC1_MPCBB2_PRIVCFGR0_PRIV29   (0x1U<<29)
#define GTZC1_MPCBB2_PRIVCFGR0_PRIV28   (0x1U<<28)
#define GTZC1_MPCBB2_PRIVCFGR0_PRIV27   (0x1U<<27)
#define GTZC1_MPCBB2_PRIVCFGR0_PRIV26   (0x1U<<26)
#define GTZC1_MPCBB2_PRIVCFGR0_PRIV25   (0x1U<<25)
#define GTZC1_MPCBB2_PRIVCFGR0_PRIV24   (0x1U<<24)
#define GTZC1_MPCBB2_PRIVCFGR0_PRIV23   (0x1U<<23)
#define GTZC1_MPCBB2_PRIVCFGR0_PRIV22   (0x1U<<22)
#define GTZC1_MPCBB2_PRIVCFGR0_PRIV21   (0x1U<<21)
#define GTZC1_MPCBB2_PRIVCFGR0_PRIV20   (0x1U<<20)
#define GTZC1_MPCBB2_PRIVCFGR0_PRIV19   (0x1U<<19)
#define GTZC1_MPCBB2_PRIVCFGR0_PRIV18   (0x1U<<18)
#define GTZC1_MPCBB2_PRIVCFGR0_PRIV17   (0x1U<<17)
#define GTZC1_MPCBB2_PRIVCFGR0_PRIV16   (0x1U<<16)
#define GTZC1_MPCBB2_PRIVCFGR0_PRIV15   (0x1U<<15)
#define GTZC1_MPCBB2_PRIVCFGR0_PRIV14   (0x1U<<14)
#define GTZC1_MPCBB2_PRIVCFGR0_PRIV13   (0x1U<<13)
#define GTZC1_MPCBB2_PRIVCFGR0_PRIV12   (0x1U<<12)
#define GTZC1_MPCBB2_PRIVCFGR0_PRIV11   (0x1U<<11)
#define GTZC1_MPCBB2_PRIVCFGR0_PRIV10   (0x1U<<10)
#define GTZC1_MPCBB2_PRIVCFGR0_PRIV9    (0x1U<<9)
#define GTZC1_MPCBB2_PRIVCFGR0_PRIV8    (0x1U<<8)
#define GTZC1_MPCBB2_PRIVCFGR0_PRIV7    (0x1U<<7)
#define GTZC1_MPCBB2_PRIVCFGR0_PRIV6    (0x1U<<6)
#define GTZC1_MPCBB2_PRIVCFGR0_PRIV5    (0x1U<<5)
#define GTZC1_MPCBB2_PRIVCFGR0_PRIV4    (0x1U<<4)
#define GTZC1_MPCBB2_PRIVCFGR0_PRIV3    (0x1U<<3)
#define GTZC1_MPCBB2_PRIVCFGR0_PRIV2    (0x1U<<2)
#define GTZC1_MPCBB2_PRIVCFGR0_PRIV1    (0x1U<<1)
#define GTZC1_MPCBB2_PRIVCFGR0_PRIV0    (0x1U<<0)

// PRIVCFGR1 Configuration

#define GTZC1_MPCBB2_PRIVCFGR1_PRIV31   (0x1U<<31)
#define GTZC1_MPCBB2_PRIVCFGR1_PRIV30   (0x1U<<30)
#define GTZC1_MPCBB2_PRIVCFGR1_PRIV29   (0x1U<<29)
#define GTZC1_MPCBB2_PRIVCFGR1_PRIV28   (0x1U<<28)
#define GTZC1_MPCBB2_PRIVCFGR1_PRIV27   (0x1U<<27)
#define GTZC1_MPCBB2_PRIVCFGR1_PRIV26   (0x1U<<26)
#define GTZC1_MPCBB2_PRIVCFGR1_PRIV25   (0x1U<<25)
#define GTZC1_MPCBB2_PRIVCFGR1_PRIV24   (0x1U<<24)
#define GTZC1_MPCBB2_PRIVCFGR1_PRIV23   (0x1U<<23)
#define GTZC1_MPCBB2_PRIVCFGR1_PRIV22   (0x1U<<22)
#define GTZC1_MPCBB2_PRIVCFGR1_PRIV21   (0x1U<<21)
#define GTZC1_MPCBB2_PRIVCFGR1_PRIV20   (0x1U<<20)
#define GTZC1_MPCBB2_PRIVCFGR1_PRIV19   (0x1U<<19)
#define GTZC1_MPCBB2_PRIVCFGR1_PRIV18   (0x1U<<18)
#define GTZC1_MPCBB2_PRIVCFGR1_PRIV17   (0x1U<<17)
#define GTZC1_MPCBB2_PRIVCFGR1_PRIV16   (0x1U<<16)
#define GTZC1_MPCBB2_PRIVCFGR1_PRIV15   (0x1U<<15)
#define GTZC1_MPCBB2_PRIVCFGR1_PRIV14   (0x1U<<14)
#define GTZC1_MPCBB2_PRIVCFGR1_PRIV13   (0x1U<<13)
#define GTZC1_MPCBB2_PRIVCFGR1_PRIV12   (0x1U<<12)
#define GTZC1_MPCBB2_PRIVCFGR1_PRIV11   (0x1U<<11)
#define GTZC1_MPCBB2_PRIVCFGR1_PRIV10   (0x1U<<10)
#define GTZC1_MPCBB2_PRIVCFGR1_PRIV9    (0x1U<<9)
#define GTZC1_MPCBB2_PRIVCFGR1_PRIV8    (0x1U<<8)
#define GTZC1_MPCBB2_PRIVCFGR1_PRIV7    (0x1U<<7)
#define GTZC1_MPCBB2_PRIVCFGR1_PRIV6    (0x1U<<6)
#define GTZC1_MPCBB2_PRIVCFGR1_PRIV5    (0x1U<<5)
#define GTZC1_MPCBB2_PRIVCFGR1_PRIV4    (0x1U<<4)
#define GTZC1_MPCBB2_PRIVCFGR1_PRIV3    (0x1U<<3)
#define GTZC1_MPCBB2_PRIVCFGR1_PRIV2    (0x1U<<2)
#define GTZC1_MPCBB2_PRIVCFGR1_PRIV1    (0x1U<<1)
#define GTZC1_MPCBB2_PRIVCFGR1_PRIV0    (0x1U<<0)

// PRIVCFGR2 Configuration

#define GTZC1_MPCBB2_PRIVCFGR2_PRIV31   (0x1U<<31)
#define GTZC1_MPCBB2_PRIVCFGR2_PRIV30   (0x1U<<30)
#define GTZC1_MPCBB2_PRIVCFGR2_PRIV29   (0x1U<<29)
#define GTZC1_MPCBB2_PRIVCFGR2_PRIV28   (0x1U<<28)
#define GTZC1_MPCBB2_PRIVCFGR2_PRIV27   (0x1U<<27)
#define GTZC1_MPCBB2_PRIVCFGR2_PRIV26   (0x1U<<26)
#define GTZC1_MPCBB2_PRIVCFGR2_PRIV25   (0x1U<<25)
#define GTZC1_MPCBB2_PRIVCFGR2_PRIV24   (0x1U<<24)
#define GTZC1_MPCBB2_PRIVCFGR2_PRIV23   (0x1U<<23)
#define GTZC1_MPCBB2_PRIVCFGR2_PRIV22   (0x1U<<22)
#define GTZC1_MPCBB2_PRIVCFGR2_PRIV21   (0x1U<<21)
#define GTZC1_MPCBB2_PRIVCFGR2_PRIV20   (0x1U<<20)
#define GTZC1_MPCBB2_PRIVCFGR2_PRIV19   (0x1U<<19)
#define GTZC1_MPCBB2_PRIVCFGR2_PRIV18   (0x1U<<18)
#define GTZC1_MPCBB2_PRIVCFGR2_PRIV17   (0x1U<<17)
#define GTZC1_MPCBB2_PRIVCFGR2_PRIV16   (0x1U<<16)
#define GTZC1_MPCBB2_PRIVCFGR2_PRIV15   (0x1U<<15)
#define GTZC1_MPCBB2_PRIVCFGR2_PRIV14   (0x1U<<14)
#define GTZC1_MPCBB2_PRIVCFGR2_PRIV13   (0x1U<<13)
#define GTZC1_MPCBB2_PRIVCFGR2_PRIV12   (0x1U<<12)
#define GTZC1_MPCBB2_PRIVCFGR2_PRIV11   (0x1U<<11)
#define GTZC1_MPCBB2_PRIVCFGR2_PRIV10   (0x1U<<10)
#define GTZC1_MPCBB2_PRIVCFGR2_PRIV9    (0x1U<<9)
#define GTZC1_MPCBB2_PRIVCFGR2_PRIV8    (0x1U<<8)
#define GTZC1_MPCBB2_PRIVCFGR2_PRIV7    (0x1U<<7)
#define GTZC1_MPCBB2_PRIVCFGR2_PRIV6    (0x1U<<6)
#define GTZC1_MPCBB2_PRIVCFGR2_PRIV5    (0x1U<<5)
#define GTZC1_MPCBB2_PRIVCFGR2_PRIV4    (0x1U<<4)
#define GTZC1_MPCBB2_PRIVCFGR2_PRIV3    (0x1U<<3)
#define GTZC1_MPCBB2_PRIVCFGR2_PRIV2    (0x1U<<2)
#define GTZC1_MPCBB2_PRIVCFGR2_PRIV1    (0x1U<<1)
#define GTZC1_MPCBB2_PRIVCFGR2_PRIV0    (0x1U<<0)

// PRIVCFGR3 Configuration

