Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32U5G9/Includes/Registers/stm32U5Gx_gtzc1_mpcbb2.h
#define GTZC1_MPCBB2_PRIVCFGR3_PRIV31   (0x1U<<31)
#define GTZC1_MPCBB2_PRIVCFGR3_PRIV30   (0x1U<<30)
#define GTZC1_MPCBB2_PRIVCFGR3_PRIV29   (0x1U<<29)
#define GTZC1_MPCBB2_PRIVCFGR3_PRIV28   (0x1U<<28)
#define GTZC1_MPCBB2_PRIVCFGR3_PRIV27   (0x1U<<27)
#define GTZC1_MPCBB2_PRIVCFGR3_PRIV26   (0x1U<<26)
#define GTZC1_MPCBB2_PRIVCFGR3_PRIV25   (0x1U<<25)
#define GTZC1_MPCBB2_PRIVCFGR3_PRIV24   (0x1U<<24)
#define GTZC1_MPCBB2_PRIVCFGR3_PRIV23   (0x1U<<23)
#define GTZC1_MPCBB2_PRIVCFGR3_PRIV22   (0x1U<<22)
#define GTZC1_MPCBB2_PRIVCFGR3_PRIV21   (0x1U<<21)
#define GTZC1_MPCBB2_PRIVCFGR3_PRIV20   (0x1U<<20)
#define GTZC1_MPCBB2_PRIVCFGR3_PRIV19   (0x1U<<19)
#define GTZC1_MPCBB2_PRIVCFGR3_PRIV18   (0x1U<<18)
#define GTZC1_MPCBB2_PRIVCFGR3_PRIV17   (0x1U<<17)
#define GTZC1_MPCBB2_PRIVCFGR3_PRIV16   (0x1U<<16)
#define GTZC1_MPCBB2_PRIVCFGR3_PRIV15   (0x1U<<15)
#define GTZC1_MPCBB2_PRIVCFGR3_PRIV14   (0x1U<<14)
#define GTZC1_MPCBB2_PRIVCFGR3_PRIV13   (0x1U<<13)
#define GTZC1_MPCBB2_PRIVCFGR3_PRIV12   (0x1U<<12)
#define GTZC1_MPCBB2_PRIVCFGR3_PRIV11   (0x1U<<11)
#define GTZC1_MPCBB2_PRIVCFGR3_PRIV10   (0x1U<<10)
#define GTZC1_MPCBB2_PRIVCFGR3_PRIV9    (0x1U<<9)
#define GTZC1_MPCBB2_PRIVCFGR3_PRIV8    (0x1U<<8)
#define GTZC1_MPCBB2_PRIVCFGR3_PRIV7    (0x1U<<7)
#define GTZC1_MPCBB2_PRIVCFGR3_PRIV6    (0x1U<<6)
#define GTZC1_MPCBB2_PRIVCFGR3_PRIV5    (0x1U<<5)
#define GTZC1_MPCBB2_PRIVCFGR3_PRIV4    (0x1U<<4)
#define GTZC1_MPCBB2_PRIVCFGR3_PRIV3    (0x1U<<3)
#define GTZC1_MPCBB2_PRIVCFGR3_PRIV2    (0x1U<<2)
#define GTZC1_MPCBB2_PRIVCFGR3_PRIV1    (0x1U<<1)
#define GTZC1_MPCBB2_PRIVCFGR3_PRIV0    (0x1U<<0)

// PRIVCFGR4 Configuration

#define GTZC1_MPCBB2_PRIVCFGR4_PRIV31   (0x1U<<31)
#define GTZC1_MPCBB2_PRIVCFGR4_PRIV30   (0x1U<<30)
#define GTZC1_MPCBB2_PRIVCFGR4_PRIV29   (0x1U<<29)
#define GTZC1_MPCBB2_PRIVCFGR4_PRIV28   (0x1U<<28)
#define GTZC1_MPCBB2_PRIVCFGR4_PRIV27   (0x1U<<27)
#define GTZC1_MPCBB2_PRIVCFGR4_PRIV26   (0x1U<<26)
#define GTZC1_MPCBB2_PRIVCFGR4_PRIV25   (0x1U<<25)
#define GTZC1_MPCBB2_PRIVCFGR4_PRIV24   (0x1U<<24)
#define GTZC1_MPCBB2_PRIVCFGR4_PRIV23   (0x1U<<23)
#define GTZC1_MPCBB2_PRIVCFGR4_PRIV22   (0x1U<<22)
#define GTZC1_MPCBB2_PRIVCFGR4_PRIV21   (0x1U<<21)
#define GTZC1_MPCBB2_PRIVCFGR4_PRIV20   (0x1U<<20)
#define GTZC1_MPCBB2_PRIVCFGR4_PRIV19   (0x1U<<19)
#define GTZC1_MPCBB2_PRIVCFGR4_PRIV18   (0x1U<<18)
#define GTZC1_MPCBB2_PRIVCFGR4_PRIV17   (0x1U<<17)
#define GTZC1_MPCBB2_PRIVCFGR4_PRIV16   (0x1U<<16)
#define GTZC1_MPCBB2_PRIVCFGR4_PRIV15   (0x1U<<15)
#define GTZC1_MPCBB2_PRIVCFGR4_PRIV14   (0x1U<<14)
#define GTZC1_MPCBB2_PRIVCFGR4_PRIV13   (0x1U<<13)
#define GTZC1_MPCBB2_PRIVCFGR4_PRIV12   (0x1U<<12)
#define GTZC1_MPCBB2_PRIVCFGR4_PRIV11   (0x1U<<11)
#define GTZC1_MPCBB2_PRIVCFGR4_PRIV10   (0x1U<<10)
#define GTZC1_MPCBB2_PRIVCFGR4_PRIV9    (0x1U<<9)
#define GTZC1_MPCBB2_PRIVCFGR4_PRIV8    (0x1U<<8)
#define GTZC1_MPCBB2_PRIVCFGR4_PRIV7    (0x1U<<7)
#define GTZC1_MPCBB2_PRIVCFGR4_PRIV6    (0x1U<<6)
#define GTZC1_MPCBB2_PRIVCFGR4_PRIV5    (0x1U<<5)
#define GTZC1_MPCBB2_PRIVCFGR4_PRIV4    (0x1U<<4)
#define GTZC1_MPCBB2_PRIVCFGR4_PRIV3    (0x1U<<3)
#define GTZC1_MPCBB2_PRIVCFGR4_PRIV2    (0x1U<<2)
#define GTZC1_MPCBB2_PRIVCFGR4_PRIV1    (0x1U<<1)
#define GTZC1_MPCBB2_PRIVCFGR4_PRIV0    (0x1U<<0)

// PRIVCFGR5 Configuration

#define GTZC1_MPCBB2_PRIVCFGR5_PRIV31   (0x1U<<31)
#define GTZC1_MPCBB2_PRIVCFGR5_PRIV30   (0x1U<<30)
#define GTZC1_MPCBB2_PRIVCFGR5_PRIV29   (0x1U<<29)
#define GTZC1_MPCBB2_PRIVCFGR5_PRIV28   (0x1U<<28)
#define GTZC1_MPCBB2_PRIVCFGR5_PRIV27   (0x1U<<27)
#define GTZC1_MPCBB2_PRIVCFGR5_PRIV26   (0x1U<<26)
#define GTZC1_MPCBB2_PRIVCFGR5_PRIV25   (0x1U<<25)
#define GTZC1_MPCBB2_PRIVCFGR5_PRIV24   (0x1U<<24)
#define GTZC1_MPCBB2_PRIVCFGR5_PRIV23   (0x1U<<23)
#define GTZC1_MPCBB2_PRIVCFGR5_PRIV22   (0x1U<<22)
#define GTZC1_MPCBB2_PRIVCFGR5_PRIV21   (0x1U<<21)
#define GTZC1_MPCBB2_PRIVCFGR5_PRIV20   (0x1U<<20)
#define GTZC1_MPCBB2_PRIVCFGR5_PRIV19   (0x1U<<19)
#define GTZC1_MPCBB2_PRIVCFGR5_PRIV18   (0x1U<<18)
#define GTZC1_MPCBB2_PRIVCFGR5_PRIV17   (0x1U<<17)
#define GTZC1_MPCBB2_PRIVCFGR5_PRIV16   (0x1U<<16)
#define GTZC1_MPCBB2_PRIVCFGR5_PRIV15   (0x1U<<15)
#define GTZC1_MPCBB2_PRIVCFGR5_PRIV14   (0x1U<<14)
#define GTZC1_MPCBB2_PRIVCFGR5_PRIV13   (0x1U<<13)
#define GTZC1_MPCBB2_PRIVCFGR5_PRIV12   (0x1U<<12)
#define GTZC1_MPCBB2_PRIVCFGR5_PRIV11   (0x1U<<11)
#define GTZC1_MPCBB2_PRIVCFGR5_PRIV10   (0x1U<<10)
#define GTZC1_MPCBB2_PRIVCFGR5_PRIV9    (0x1U<<9)
#define GTZC1_MPCBB2_PRIVCFGR5_PRIV8    (0x1U<<8)
#define GTZC1_MPCBB2_PRIVCFGR5_PRIV7    (0x1U<<7)
#define GTZC1_MPCBB2_PRIVCFGR5_PRIV6    (0x1U<<6)
#define GTZC1_MPCBB2_PRIVCFGR5_PRIV5    (0x1U<<5)
#define GTZC1_MPCBB2_PRIVCFGR5_PRIV4    (0x1U<<4)
#define GTZC1_MPCBB2_PRIVCFGR5_PRIV3    (0x1U<<3)
#define GTZC1_MPCBB2_PRIVCFGR5_PRIV2    (0x1U<<2)
#define GTZC1_MPCBB2_PRIVCFGR5_PRIV1    (0x1U<<1)
#define GTZC1_MPCBB2_PRIVCFGR5_PRIV0    (0x1U<<0)

// PRIVCFGR6 Configuration

#define GTZC1_MPCBB2_PRIVCFGR6_PRIV31   (0x1U<<31)
#define GTZC1_MPCBB2_PRIVCFGR6_PRIV30   (0x1U<<30)
#define GTZC1_MPCBB2_PRIVCFGR6_PRIV29   (0x1U<<29)
#define GTZC1_MPCBB2_PRIVCFGR6_PRIV28   (0x1U<<28)
#define GTZC1_MPCBB2_PRIVCFGR6_PRIV27   (0x1U<<27)
#define GTZC1_MPCBB2_PRIVCFGR6_PRIV26   (0x1U<<26)
#define GTZC1_MPCBB2_PRIVCFGR6_PRIV25   (0x1U<<25)
#define GTZC1_MPCBB2_PRIVCFGR6_PRIV24   (0x1U<<24)
#define GTZC1_MPCBB2_PRIVCFGR6_PRIV23   (0x1U<<23)
#define GTZC1_MPCBB2_PRIVCFGR6_PRIV22   (0x1U<<22)
#define GTZC1_MPCBB2_PRIVCFGR6_PRIV21   (0x1U<<21)
#define GTZC1_MPCBB2_PRIVCFGR6_PRIV20   (0x1U<<20)
#define GTZC1_MPCBB2_PRIVCFGR6_PRIV19   (0x1U<<19)
#define GTZC1_MPCBB2_PRIVCFGR6_PRIV18   (0x1U<<18)
#define GTZC1_MPCBB2_PRIVCFGR6_PRIV17   (0x1U<<17)
#define GTZC1_MPCBB2_PRIVCFGR6_PRIV16   (0x1U<<16)
#define GTZC1_MPCBB2_PRIVCFGR6_PRIV15   (0x1U<<15)
#define GTZC1_MPCBB2_PRIVCFGR6_PRIV14   (0x1U<<14)
#define GTZC1_MPCBB2_PRIVCFGR6_PRIV13   (0x1U<<13)
#define GTZC1_MPCBB2_PRIVCFGR6_PRIV12   (0x1U<<12)
#define GTZC1_MPCBB2_PRIVCFGR6_PRIV11   (0x1U<<11)
#define GTZC1_MPCBB2_PRIVCFGR6_PRIV10   (0x1U<<10)
#define GTZC1_MPCBB2_PRIVCFGR6_PRIV9    (0x1U<<9)
#define GTZC1_MPCBB2_PRIVCFGR6_PRIV8    (0x1U<<8)
#define GTZC1_MPCBB2_PRIVCFGR6_PRIV7    (0x1U<<7)
#define GTZC1_MPCBB2_PRIVCFGR6_PRIV6    (0x1U<<6)
#define GTZC1_MPCBB2_PRIVCFGR6_PRIV5    (0x1U<<5)
#define GTZC1_MPCBB2_PRIVCFGR6_PRIV4    (0x1U<<4)
#define GTZC1_MPCBB2_PRIVCFGR6_PRIV3    (0x1U<<3)
#define GTZC1_MPCBB2_PRIVCFGR6_PRIV2    (0x1U<<2)
#define GTZC1_MPCBB2_PRIVCFGR6_PRIV1    (0x1U<<1)
#define GTZC1_MPCBB2_PRIVCFGR6_PRIV0    (0x1U<<0)

// PRIVCFGR7 Configuration

#define GTZC1_MPCBB2_PRIVCFGR7_PRIV31   (0x1U<<31)
#define GTZC1_MPCBB2_PRIVCFGR7_PRIV30   (0x1U<<30)
#define GTZC1_MPCBB2_PRIVCFGR7_PRIV29   (0x1U<<29)
#define GTZC1_MPCBB2_PRIVCFGR7_PRIV28   (0x1U<<28)
#define GTZC1_MPCBB2_PRIVCFGR7_PRIV27   (0x1U<<27)
#define GTZC1_MPCBB2_PRIVCFGR7_PRIV26   (0x1U<<26)
#define GTZC1_MPCBB2_PRIVCFGR7_PRIV25   (0x1U<<25)
#define GTZC1_MPCBB2_PRIVCFGR7_PRIV24   (0x1U<<24)
#define GTZC1_MPCBB2_PRIVCFGR7_PRIV23   (0x1U<<23)
#define GTZC1_MPCBB2_PRIVCFGR7_PRIV22   (0x1U<<22)
#define GTZC1_MPCBB2_PRIVCFGR7_PRIV21   (0x1U<<21)
#define GTZC1_MPCBB2_PRIVCFGR7_PRIV20   (0x1U<<20)
#define GTZC1_MPCBB2_PRIVCFGR7_PRIV19   (0x1U<<19)
#define GTZC1_MPCBB2_PRIVCFGR7_PRIV18   (0x1U<<18)
#define GTZC1_MPCBB2_PRIVCFGR7_PRIV17   (0x1U<<17)
#define GTZC1_MPCBB2_PRIVCFGR7_PRIV16   (0x1U<<16)
#define GTZC1_MPCBB2_PRIVCFGR7_PRIV15   (0x1U<<15)
#define GTZC1_MPCBB2_PRIVCFGR7_PRIV14   (0x1U<<14)
#define GTZC1_MPCBB2_PRIVCFGR7_PRIV13   (0x1U<<13)
#define GTZC1_MPCBB2_PRIVCFGR7_PRIV12   (0x1U<<12)
#define GTZC1_MPCBB2_PRIVCFGR7_PRIV11   (0x1U<<11)
#define GTZC1_MPCBB2_PRIVCFGR7_PRIV10   (0x1U<<10)
#define GTZC1_MPCBB2_PRIVCFGR7_PRIV9    (0x1U<<9)
#define GTZC1_MPCBB2_PRIVCFGR7_PRIV8    (0x1U<<8)
#define GTZC1_MPCBB2_PRIVCFGR7_PRIV7    (0x1U<<7)
#define GTZC1_MPCBB2_PRIVCFGR7_PRIV6    (0x1U<<6)
#define GTZC1_MPCBB2_PRIVCFGR7_PRIV5    (0x1U<<5)
#define GTZC1_MPCBB2_PRIVCFGR7_PRIV4    (0x1U<<4)
#define GTZC1_MPCBB2_PRIVCFGR7_PRIV3    (0x1U<<3)
#define GTZC1_MPCBB2_PRIVCFGR7_PRIV2    (0x1U<<2)
#define GTZC1_MPCBB2_PRIVCFGR7_PRIV1    (0x1U<<1)
#define GTZC1_MPCBB2_PRIVCFGR7_PRIV0    (0x1U<<0)

// PRIVCFGR8 Configuration

#define GTZC1_MPCBB2_PRIVCFGR8_PRIV31   (0x1U<<31)
#define GTZC1_MPCBB2_PRIVCFGR8_PRIV30   (0x1U<<30)
#define GTZC1_MPCBB2_PRIVCFGR8_PRIV29   (0x1U<<29)
#define GTZC1_MPCBB2_PRIVCFGR8_PRIV28   (0x1U<<28)
#define GTZC1_MPCBB2_PRIVCFGR8_PRIV27   (0x1U<<27)
#define GTZC1_MPCBB2_PRIVCFGR8_PRIV26   (0x1U<<26)
#define GTZC1_MPCBB2_PRIVCFGR8_PRIV25   (0x1U<<25)
#define GTZC1_MPCBB2_PRIVCFGR8_PRIV24   (0x1U<<24)
#define GTZC1_MPCBB2_PRIVCFGR8_PRIV23   (0x1U<<23)
#define GTZC1_MPCBB2_PRIVCFGR8_PRIV22   (0x1U<<22)
#define GTZC1_MPCBB2_PRIVCFGR8_PRIV21   (0x1U<<21)
#define GTZC1_MPCBB2_PRIVCFGR8_PRIV20   (0x1U<<20)
#define GTZC1_MPCBB2_PRIVCFGR8_PRIV19   (0x1U<<19)
#define GTZC1_MPCBB2_PRIVCFGR8_PRIV18   (0x1U<<18)
#define GTZC1_MPCBB2_PRIVCFGR8_PRIV17   (0x1U<<17)
#define GTZC1_MPCBB2_PRIVCFGR8_PRIV16   (0x1U<<16)
#define GTZC1_MPCBB2_PRIVCFGR8_PRIV15   (0x1U<<15)
#define GTZC1_MPCBB2_PRIVCFGR8_PRIV14   (0x1U<<14)
#define GTZC1_MPCBB2_PRIVCFGR8_PRIV13   (0x1U<<13)
#define GTZC1_MPCBB2_PRIVCFGR8_PRIV12   (0x1U<<12)
#define GTZC1_MPCBB2_PRIVCFGR8_PRIV11   (0x1U<<11)
#define GTZC1_MPCBB2_PRIVCFGR8_PRIV10   (0x1U<<10)
#define GTZC1_MPCBB2_PRIVCFGR8_PRIV9    (0x1U<<9)
#define GTZC1_MPCBB2_PRIVCFGR8_PRIV8    (0x1U<<8)
#define GTZC1_MPCBB2_PRIVCFGR8_PRIV7    (0x1U<<7)
#define GTZC1_MPCBB2_PRIVCFGR8_PRIV6    (0x1U<<6)
#define GTZC1_MPCBB2_PRIVCFGR8_PRIV5    (0x1U<<5)
#define GTZC1_MPCBB2_PRIVCFGR8_PRIV4    (0x1U<<4)
#define GTZC1_MPCBB2_PRIVCFGR8_PRIV3    (0x1U<<3)
#define GTZC1_MPCBB2_PRIVCFGR8_PRIV2    (0x1U<<2)
#define GTZC1_MPCBB2_PRIVCFGR8_PRIV1    (0x1U<<1)
#define GTZC1_MPCBB2_PRIVCFGR8_PRIV0    (0x1U<<0)

// PRIVCFGR9 Configuration

#define GTZC1_MPCBB2_PRIVCFGR9_PRIV31   (0x1U<<31)
#define GTZC1_MPCBB2_PRIVCFGR9_PRIV30   (0x1U<<30)
#define GTZC1_MPCBB2_PRIVCFGR9_PRIV29   (0x1U<<29)
#define GTZC1_MPCBB2_PRIVCFGR9_PRIV28   (0x1U<<28)
#define GTZC1_MPCBB2_PRIVCFGR9_PRIV27   (0x1U<<27)
#define GTZC1_MPCBB2_PRIVCFGR9_PRIV26   (0x1U<<26)
#define GTZC1_MPCBB2_PRIVCFGR9_PRIV25   (0x1U<<25)
#define GTZC1_MPCBB2_PRIVCFGR9_PRIV24   (0x1U<<24)
#define GTZC1_MPCBB2_PRIVCFGR9_PRIV23   (0x1U<<23)
#define GTZC1_MPCBB2_PRIVCFGR9_PRIV22   (0x1U<<22)
#define GTZC1_MPCBB2_PRIVCFGR9_PRIV21   (0x1U<<21)
#define GTZC1_MPCBB2_PRIVCFGR9_PRIV20   (0x1U<<20)
#define GTZC1_MPCBB2_PRIVCFGR9_PRIV19   (0x1U<<19)
#define GTZC1_MPCBB2_PRIVCFGR9_PRIV18   (0x1U<<18)
#define GTZC1_MPCBB2_PRIVCFGR9_PRIV17   (0x1U<<17)
#define GTZC1_MPCBB2_PRIVCFGR9_PRIV16   (0x1U<<16)
#define GTZC1_MPCBB2_PRIVCFGR9_PRIV15   (0x1U<<15)
#define GTZC1_MPCBB2_PRIVCFGR9_PRIV14   (0x1U<<14)
#define GTZC1_MPCBB2_PRIVCFGR9_PRIV13   (0x1U<<13)
#define GTZC1_MPCBB2_PRIVCFGR9_PRIV12   (0x1U<<12)
#define GTZC1_MPCBB2_PRIVCFGR9_PRIV11   (0x1U<<11)
#define GTZC1_MPCBB2_PRIVCFGR9_PRIV10   (0x1U<<10)
#define GTZC1_MPCBB2_PRIVCFGR9_PRIV9    (0x1U<<9)
#define GTZC1_MPCBB2_PRIVCFGR9_PRIV8    (0x1U<<8)
#define GTZC1_MPCBB2_PRIVCFGR9_PRIV7    (0x1U<<7)
#define GTZC1_MPCBB2_PRIVCFGR9_PRIV6    (0x1U<<6)
#define GTZC1_MPCBB2_PRIVCFGR9_PRIV5    (0x1U<<5)
#define GTZC1_MPCBB2_PRIVCFGR9_PRIV4    (0x1U<<4)
#define GTZC1_MPCBB2_PRIVCFGR9_PRIV3    (0x1U<<3)
#define GTZC1_MPCBB2_PRIVCFGR9_PRIV2    (0x1U<<2)
#define GTZC1_MPCBB2_PRIVCFGR9_PRIV1    (0x1U<<1)
#define GTZC1_MPCBB2_PRIVCFGR9_PRIV0    (0x1U<<0)

// PRIVCFGR10 Configuration

#define GTZC1_MPCBB2_PRIVCFGR10_PRIV31  (0x1U<<31)
#define GTZC1_MPCBB2_PRIVCFGR10_PRIV30  (0x1U<<30)
#define GTZC1_MPCBB2_PRIVCFGR10_PRIV29  (0x1U<<29)
#define GTZC1_MPCBB2_PRIVCFGR10_PRIV28  (0x1U<<28)
#define GTZC1_MPCBB2_PRIVCFGR10_PRIV27  (0x1U<<27)
#define GTZC1_MPCBB2_PRIVCFGR10_PRIV26  (0x1U<<26)
#define GTZC1_MPCBB2_PRIVCFGR10_PRIV25  (0x1U<<25)
#define GTZC1_MPCBB2_PRIVCFGR10_PRIV24  (0x1U<<24)
#define GTZC1_MPCBB2_PRIVCFGR10_PRIV23  (0x1U<<23)
#define GTZC1_MPCBB2_PRIVCFGR10_PRIV22  (0x1U<<22)
#define GTZC1_MPCBB2_PRIVCFGR10_PRIV21  (0x1U<<21)
#define GTZC1_MPCBB2_PRIVCFGR10_PRIV20  (0x1U<<20)
#define GTZC1_MPCBB2_PRIVCFGR10_PRIV19  (0x1U<<19)
#define GTZC1_MPCBB2_PRIVCFGR10_PRIV18  (0x1U<<18)
#define GTZC1_MPCBB2_PRIVCFGR10_PRIV17  (0x1U<<17)
#define GTZC1_MPCBB2_PRIVCFGR10_PRIV16  (0x1U<<16)
#define GTZC1_MPCBB2_PRIVCFGR10_PRIV15  (0x1U<<15)
#define GTZC1_MPCBB2_PRIVCFGR10_PRIV14  (0x1U<<14)
#define GTZC1_MPCBB2_PRIVCFGR10_PRIV13  (0x1U<<13)
#define GTZC1_MPCBB2_PRIVCFGR10_PRIV12  (0x1U<<12)
#define GTZC1_MPCBB2_PRIVCFGR10_PRIV11  (0x1U<<11)
#define GTZC1_MPCBB2_PRIVCFGR10_PRIV10  (0x1U<<10)
#define GTZC1_MPCBB2_PRIVCFGR10_PRIV9   (0x1U<<9)
#define GTZC1_MPCBB2_PRIVCFGR10_PRIV8   (0x1U<<8)
#define GTZC1_MPCBB2_PRIVCFGR10_PRIV7   (0x1U<<7)
#define GTZC1_MPCBB2_PRIVCFGR10_PRIV6   (0x1U<<6)
#define GTZC1_MPCBB2_PRIVCFGR10_PRIV5   (0x1U<<5)
#define GTZC1_MPCBB2_PRIVCFGR10_PRIV4   (0x1U<<4)
#define GTZC1_MPCBB2_PRIVCFGR10_PRIV3   (0x1U<<3)
#define GTZC1_MPCBB2_PRIVCFGR10_PRIV2   (0x1U<<2)
#define GTZC1_MPCBB2_PRIVCFGR10_PRIV1   (0x1U<<1)
#define GTZC1_MPCBB2_PRIVCFGR10_PRIV0   (0x1U<<0)

// PRIVCFGR11 Configuration

#define GTZC1_MPCBB2_PRIVCFGR11_PRIV31  (0x1U<<31)
#define GTZC1_MPCBB2_PRIVCFGR11_PRIV30  (0x1U<<30)
#define GTZC1_MPCBB2_PRIVCFGR11_PRIV29  (0x1U<<29)
#define GTZC1_MPCBB2_PRIVCFGR11_PRIV28  (0x1U<<28)
#define GTZC1_MPCBB2_PRIVCFGR11_PRIV27  (0x1U<<27)
#define GTZC1_MPCBB2_PRIVCFGR11_PRIV26  (0x1U<<26)
#define GTZC1_MPCBB2_PRIVCFGR11_PRIV25  (0x1U<<25)
#define GTZC1_MPCBB2_PRIVCFGR11_PRIV24  (0x1U<<24)
#define GTZC1_MPCBB2_PRIVCFGR11_PRIV23  (0x1U<<23)
#define GTZC1_MPCBB2_PRIVCFGR11_PRIV22  (0x1U<<22)
#define GTZC1_MPCBB2_PRIVCFGR11_PRIV21  (0x1U<<21)
#define GTZC1_MPCBB2_PRIVCFGR11_PRIV20  (0x1U<<20)
#define GTZC1_MPCBB2_PRIVCFGR11_PRIV19  (0x1U<<19)
#define GTZC1_MPCBB2_PRIVCFGR11_PRIV18  (0x1U<<18)
#define GTZC1_MPCBB2_PRIVCFGR11_PRIV17  (0x1U<<17)
#define GTZC1_MPCBB2_PRIVCFGR11_PRIV16  (0x1U<<16)
#define GTZC1_MPCBB2_PRIVCFGR11_PRIV15  (0x1U<<15)
#define GTZC1_MPCBB2_PRIVCFGR11_PRIV14  (0x1U<<14)
#define GTZC1_MPCBB2_PRIVCFGR11_PRIV13  (0x1U<<13)
#define GTZC1_MPCBB2_PRIVCFGR11_PRIV12  (0x1U<<12)
#define GTZC1_MPCBB2_PRIVCFGR11_PRIV11  (0x1U<<11)
#define GTZC1_MPCBB2_PRIVCFGR11_PRIV10  (0x1U<<10)
#define GTZC1_MPCBB2_PRIVCFGR11_PRIV9   (0x1U<<9)
#define GTZC1_MPCBB2_PRIVCFGR11_PRIV8   (0x1U<<8)
#define GTZC1_MPCBB2_PRIVCFGR11_PRIV7   (0x1U<<7)
#define GTZC1_MPCBB2_PRIVCFGR11_PRIV6   (0x1U<<6)
#define GTZC1_MPCBB2_PRIVCFGR11_PRIV5   (0x1U<<5)
#define GTZC1_MPCBB2_PRIVCFGR11_PRIV4   (0x1U<<4)
#define GTZC1_MPCBB2_PRIVCFGR11_PRIV3   (0x1U<<3)
#define GTZC1_MPCBB2_PRIVCFGR11_PRIV2   (0x1U<<2)
#define GTZC1_MPCBB2_PRIVCFGR11_PRIV1   (0x1U<<1)
#define GTZC1_MPCBB2_PRIVCFGR11_PRIV0   (0x1U<<0)

