Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32U5G9/Includes/Registers/stm32U5Gx_gtzc1_mpcbb2.h
// PRIVCFGR12 Configuration

#define GTZC1_MPCBB2_PRIVCFGR12_PRIV31  (0x1U<<31)
#define GTZC1_MPCBB2_PRIVCFGR12_PRIV30  (0x1U<<30)
#define GTZC1_MPCBB2_PRIVCFGR12_PRIV29  (0x1U<<29)
#define GTZC1_MPCBB2_PRIVCFGR12_PRIV28  (0x1U<<28)
#define GTZC1_MPCBB2_PRIVCFGR12_PRIV27  (0x1U<<27)
#define GTZC1_MPCBB2_PRIVCFGR12_PRIV26  (0x1U<<26)
#define GTZC1_MPCBB2_PRIVCFGR12_PRIV25  (0x1U<<25)
#define GTZC1_MPCBB2_PRIVCFGR12_PRIV24  (0x1U<<24)
#define GTZC1_MPCBB2_PRIVCFGR12_PRIV23  (0x1U<<23)
#define GTZC1_MPCBB2_PRIVCFGR12_PRIV22  (0x1U<<22)
#define GTZC1_MPCBB2_PRIVCFGR12_PRIV21  (0x1U<<21)
#define GTZC1_MPCBB2_PRIVCFGR12_PRIV20  (0x1U<<20)
#define GTZC1_MPCBB2_PRIVCFGR12_PRIV19  (0x1U<<19)
#define GTZC1_MPCBB2_PRIVCFGR12_PRIV18  (0x1U<<18)
#define GTZC1_MPCBB2_PRIVCFGR12_PRIV17  (0x1U<<17)
#define GTZC1_MPCBB2_PRIVCFGR12_PRIV16  (0x1U<<16)
#define GTZC1_MPCBB2_PRIVCFGR12_PRIV15  (0x1U<<15)
#define GTZC1_MPCBB2_PRIVCFGR12_PRIV14  (0x1U<<14)
#define GTZC1_MPCBB2_PRIVCFGR12_PRIV13  (0x1U<<13)
#define GTZC1_MPCBB2_PRIVCFGR12_PRIV12  (0x1U<<12)
#define GTZC1_MPCBB2_PRIVCFGR12_PRIV11  (0x1U<<11)
#define GTZC1_MPCBB2_PRIVCFGR12_PRIV10  (0x1U<<10)
#define GTZC1_MPCBB2_PRIVCFGR12_PRIV9   (0x1U<<9)
#define GTZC1_MPCBB2_PRIVCFGR12_PRIV8   (0x1U<<8)
#define GTZC1_MPCBB2_PRIVCFGR12_PRIV7   (0x1U<<7)
#define GTZC1_MPCBB2_PRIVCFGR12_PRIV6   (0x1U<<6)
#define GTZC1_MPCBB2_PRIVCFGR12_PRIV5   (0x1U<<5)
#define GTZC1_MPCBB2_PRIVCFGR12_PRIV4   (0x1U<<4)
#define GTZC1_MPCBB2_PRIVCFGR12_PRIV3   (0x1U<<3)
#define GTZC1_MPCBB2_PRIVCFGR12_PRIV2   (0x1U<<2)
#define GTZC1_MPCBB2_PRIVCFGR12_PRIV1   (0x1U<<1)
#define GTZC1_MPCBB2_PRIVCFGR12_PRIV0   (0x1U<<0)

// PRIVCFGR13 Configuration

#define GTZC1_MPCBB2_PRIVCFGR13_PRIV31  (0x1U<<31)
#define GTZC1_MPCBB2_PRIVCFGR13_PRIV30  (0x1U<<30)
#define GTZC1_MPCBB2_PRIVCFGR13_PRIV29  (0x1U<<29)
#define GTZC1_MPCBB2_PRIVCFGR13_PRIV28  (0x1U<<28)
#define GTZC1_MPCBB2_PRIVCFGR13_PRIV27  (0x1U<<27)
#define GTZC1_MPCBB2_PRIVCFGR13_PRIV26  (0x1U<<26)
#define GTZC1_MPCBB2_PRIVCFGR13_PRIV25  (0x1U<<25)
#define GTZC1_MPCBB2_PRIVCFGR13_PRIV24  (0x1U<<24)
#define GTZC1_MPCBB2_PRIVCFGR13_PRIV23  (0x1U<<23)
#define GTZC1_MPCBB2_PRIVCFGR13_PRIV22  (0x1U<<22)
#define GTZC1_MPCBB2_PRIVCFGR13_PRIV21  (0x1U<<21)
#define GTZC1_MPCBB2_PRIVCFGR13_PRIV20  (0x1U<<20)
#define GTZC1_MPCBB2_PRIVCFGR13_PRIV19  (0x1U<<19)
#define GTZC1_MPCBB2_PRIVCFGR13_PRIV18  (0x1U<<18)
#define GTZC1_MPCBB2_PRIVCFGR13_PRIV17  (0x1U<<17)
#define GTZC1_MPCBB2_PRIVCFGR13_PRIV16  (0x1U<<16)
#define GTZC1_MPCBB2_PRIVCFGR13_PRIV15  (0x1U<<15)
#define GTZC1_MPCBB2_PRIVCFGR13_PRIV14  (0x1U<<14)
#define GTZC1_MPCBB2_PRIVCFGR13_PRIV13  (0x1U<<13)
#define GTZC1_MPCBB2_PRIVCFGR13_PRIV12  (0x1U<<12)
#define GTZC1_MPCBB2_PRIVCFGR13_PRIV11  (0x1U<<11)
#define GTZC1_MPCBB2_PRIVCFGR13_PRIV10  (0x1U<<10)
#define GTZC1_MPCBB2_PRIVCFGR13_PRIV9   (0x1U<<9)
#define GTZC1_MPCBB2_PRIVCFGR13_PRIV8   (0x1U<<8)
#define GTZC1_MPCBB2_PRIVCFGR13_PRIV7   (0x1U<<7)
#define GTZC1_MPCBB2_PRIVCFGR13_PRIV6   (0x1U<<6)
#define GTZC1_MPCBB2_PRIVCFGR13_PRIV5   (0x1U<<5)
#define GTZC1_MPCBB2_PRIVCFGR13_PRIV4   (0x1U<<4)
#define GTZC1_MPCBB2_PRIVCFGR13_PRIV3   (0x1U<<3)
#define GTZC1_MPCBB2_PRIVCFGR13_PRIV2   (0x1U<<2)
#define GTZC1_MPCBB2_PRIVCFGR13_PRIV1   (0x1U<<1)
#define GTZC1_MPCBB2_PRIVCFGR13_PRIV0   (0x1U<<0)

// PRIVCFGR14 Configuration

#define GTZC1_MPCBB2_PRIVCFGR14_PRIV31  (0x1U<<31)
#define GTZC1_MPCBB2_PRIVCFGR14_PRIV30  (0x1U<<30)
#define GTZC1_MPCBB2_PRIVCFGR14_PRIV29  (0x1U<<29)
#define GTZC1_MPCBB2_PRIVCFGR14_PRIV28  (0x1U<<28)
#define GTZC1_MPCBB2_PRIVCFGR14_PRIV27  (0x1U<<27)
#define GTZC1_MPCBB2_PRIVCFGR14_PRIV26  (0x1U<<26)
#define GTZC1_MPCBB2_PRIVCFGR14_PRIV25  (0x1U<<25)
#define GTZC1_MPCBB2_PRIVCFGR14_PRIV24  (0x1U<<24)
#define GTZC1_MPCBB2_PRIVCFGR14_PRIV23  (0x1U<<23)
#define GTZC1_MPCBB2_PRIVCFGR14_PRIV22  (0x1U<<22)
#define GTZC1_MPCBB2_PRIVCFGR14_PRIV21  (0x1U<<21)
#define GTZC1_MPCBB2_PRIVCFGR14_PRIV20  (0x1U<<20)
#define GTZC1_MPCBB2_PRIVCFGR14_PRIV19  (0x1U<<19)
#define GTZC1_MPCBB2_PRIVCFGR14_PRIV18  (0x1U<<18)
#define GTZC1_MPCBB2_PRIVCFGR14_PRIV17  (0x1U<<17)
#define GTZC1_MPCBB2_PRIVCFGR14_PRIV16  (0x1U<<16)
#define GTZC1_MPCBB2_PRIVCFGR14_PRIV15  (0x1U<<15)
#define GTZC1_MPCBB2_PRIVCFGR14_PRIV14  (0x1U<<14)
#define GTZC1_MPCBB2_PRIVCFGR14_PRIV13  (0x1U<<13)
#define GTZC1_MPCBB2_PRIVCFGR14_PRIV12  (0x1U<<12)
#define GTZC1_MPCBB2_PRIVCFGR14_PRIV11  (0x1U<<11)
#define GTZC1_MPCBB2_PRIVCFGR14_PRIV10  (0x1U<<10)
#define GTZC1_MPCBB2_PRIVCFGR14_PRIV9   (0x1U<<9)
#define GTZC1_MPCBB2_PRIVCFGR14_PRIV8   (0x1U<<8)
#define GTZC1_MPCBB2_PRIVCFGR14_PRIV7   (0x1U<<7)
#define GTZC1_MPCBB2_PRIVCFGR14_PRIV6   (0x1U<<6)
#define GTZC1_MPCBB2_PRIVCFGR14_PRIV5   (0x1U<<5)
#define GTZC1_MPCBB2_PRIVCFGR14_PRIV4   (0x1U<<4)
#define GTZC1_MPCBB2_PRIVCFGR14_PRIV3   (0x1U<<3)
#define GTZC1_MPCBB2_PRIVCFGR14_PRIV2   (0x1U<<2)
#define GTZC1_MPCBB2_PRIVCFGR14_PRIV1   (0x1U<<1)
#define GTZC1_MPCBB2_PRIVCFGR14_PRIV0   (0x1U<<0)

// PRIVCFGR15 Configuration

#define GTZC1_MPCBB2_PRIVCFGR15_PRIV31  (0x1U<<31)
#define GTZC1_MPCBB2_PRIVCFGR15_PRIV30  (0x1U<<30)
#define GTZC1_MPCBB2_PRIVCFGR15_PRIV29  (0x1U<<29)
#define GTZC1_MPCBB2_PRIVCFGR15_PRIV28  (0x1U<<28)
#define GTZC1_MPCBB2_PRIVCFGR15_PRIV27  (0x1U<<27)
#define GTZC1_MPCBB2_PRIVCFGR15_PRIV26  (0x1U<<26)
#define GTZC1_MPCBB2_PRIVCFGR15_PRIV25  (0x1U<<25)
#define GTZC1_MPCBB2_PRIVCFGR15_PRIV24  (0x1U<<24)
#define GTZC1_MPCBB2_PRIVCFGR15_PRIV23  (0x1U<<23)
#define GTZC1_MPCBB2_PRIVCFGR15_PRIV22  (0x1U<<22)
#define GTZC1_MPCBB2_PRIVCFGR15_PRIV21  (0x1U<<21)
#define GTZC1_MPCBB2_PRIVCFGR15_PRIV20  (0x1U<<20)
#define GTZC1_MPCBB2_PRIVCFGR15_PRIV19  (0x1U<<19)
#define GTZC1_MPCBB2_PRIVCFGR15_PRIV18  (0x1U<<18)
#define GTZC1_MPCBB2_PRIVCFGR15_PRIV17  (0x1U<<17)
#define GTZC1_MPCBB2_PRIVCFGR15_PRIV16  (0x1U<<16)
#define GTZC1_MPCBB2_PRIVCFGR15_PRIV15  (0x1U<<15)
#define GTZC1_MPCBB2_PRIVCFGR15_PRIV14  (0x1U<<14)
#define GTZC1_MPCBB2_PRIVCFGR15_PRIV13  (0x1U<<13)
#define GTZC1_MPCBB2_PRIVCFGR15_PRIV12  (0x1U<<12)
#define GTZC1_MPCBB2_PRIVCFGR15_PRIV11  (0x1U<<11)
#define GTZC1_MPCBB2_PRIVCFGR15_PRIV10  (0x1U<<10)
#define GTZC1_MPCBB2_PRIVCFGR15_PRIV9   (0x1U<<9)
#define GTZC1_MPCBB2_PRIVCFGR15_PRIV8   (0x1U<<8)
#define GTZC1_MPCBB2_PRIVCFGR15_PRIV7   (0x1U<<7)
#define GTZC1_MPCBB2_PRIVCFGR15_PRIV6   (0x1U<<6)
#define GTZC1_MPCBB2_PRIVCFGR15_PRIV5   (0x1U<<5)
#define GTZC1_MPCBB2_PRIVCFGR15_PRIV4   (0x1U<<4)
#define GTZC1_MPCBB2_PRIVCFGR15_PRIV3   (0x1U<<3)
#define GTZC1_MPCBB2_PRIVCFGR15_PRIV2   (0x1U<<2)
#define GTZC1_MPCBB2_PRIVCFGR15_PRIV1   (0x1U<<1)
#define GTZC1_MPCBB2_PRIVCFGR15_PRIV0   (0x1U<<0)

// PRIVCFGR16 Configuration

