Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32U5G9/Includes/Registers/stm32U5Gx_gtzc1_mpcbb2.h
#define GTZC1_MPCBB2_PRIVCFGR16_PRIV31  (0x1U<<31)
#define GTZC1_MPCBB2_PRIVCFGR16_PRIV30  (0x1U<<30)
#define GTZC1_MPCBB2_PRIVCFGR16_PRIV29  (0x1U<<29)
#define GTZC1_MPCBB2_PRIVCFGR16_PRIV28  (0x1U<<28)
#define GTZC1_MPCBB2_PRIVCFGR16_PRIV27  (0x1U<<27)
#define GTZC1_MPCBB2_PRIVCFGR16_PRIV26  (0x1U<<26)
#define GTZC1_MPCBB2_PRIVCFGR16_PRIV25  (0x1U<<25)
#define GTZC1_MPCBB2_PRIVCFGR16_PRIV24  (0x1U<<24)
#define GTZC1_MPCBB2_PRIVCFGR16_PRIV23  (0x1U<<23)
#define GTZC1_MPCBB2_PRIVCFGR16_PRIV22  (0x1U<<22)
#define GTZC1_MPCBB2_PRIVCFGR16_PRIV21  (0x1U<<21)
#define GTZC1_MPCBB2_PRIVCFGR16_PRIV20  (0x1U<<20)
#define GTZC1_MPCBB2_PRIVCFGR16_PRIV19  (0x1U<<19)
#define GTZC1_MPCBB2_PRIVCFGR16_PRIV18  (0x1U<<18)
#define GTZC1_MPCBB2_PRIVCFGR16_PRIV17  (0x1U<<17)
#define GTZC1_MPCBB2_PRIVCFGR16_PRIV16  (0x1U<<16)
#define GTZC1_MPCBB2_PRIVCFGR16_PRIV15  (0x1U<<15)
#define GTZC1_MPCBB2_PRIVCFGR16_PRIV14  (0x1U<<14)
#define GTZC1_MPCBB2_PRIVCFGR16_PRIV13  (0x1U<<13)
#define GTZC1_MPCBB2_PRIVCFGR16_PRIV12  (0x1U<<12)
#define GTZC1_MPCBB2_PRIVCFGR16_PRIV11  (0x1U<<11)
#define GTZC1_MPCBB2_PRIVCFGR16_PRIV10  (0x1U<<10)
#define GTZC1_MPCBB2_PRIVCFGR16_PRIV9   (0x1U<<9)
#define GTZC1_MPCBB2_PRIVCFGR16_PRIV8   (0x1U<<8)
#define GTZC1_MPCBB2_PRIVCFGR16_PRIV7   (0x1U<<7)
#define GTZC1_MPCBB2_PRIVCFGR16_PRIV6   (0x1U<<6)
#define GTZC1_MPCBB2_PRIVCFGR16_PRIV5   (0x1U<<5)
#define GTZC1_MPCBB2_PRIVCFGR16_PRIV4   (0x1U<<4)
#define GTZC1_MPCBB2_PRIVCFGR16_PRIV3   (0x1U<<3)
#define GTZC1_MPCBB2_PRIVCFGR16_PRIV2   (0x1U<<2)
#define GTZC1_MPCBB2_PRIVCFGR16_PRIV1   (0x1U<<1)
#define GTZC1_MPCBB2_PRIVCFGR16_PRIV0   (0x1U<<0)

// PRIVCFGR17 Configuration

#define GTZC1_MPCBB2_PRIVCFGR17_PRIV31  (0x1U<<31)
#define GTZC1_MPCBB2_PRIVCFGR17_PRIV30  (0x1U<<30)
#define GTZC1_MPCBB2_PRIVCFGR17_PRIV29  (0x1U<<29)
#define GTZC1_MPCBB2_PRIVCFGR17_PRIV28  (0x1U<<28)
#define GTZC1_MPCBB2_PRIVCFGR17_PRIV27  (0x1U<<27)
#define GTZC1_MPCBB2_PRIVCFGR17_PRIV26  (0x1U<<26)
#define GTZC1_MPCBB2_PRIVCFGR17_PRIV25  (0x1U<<25)
#define GTZC1_MPCBB2_PRIVCFGR17_PRIV24  (0x1U<<24)
#define GTZC1_MPCBB2_PRIVCFGR17_PRIV23  (0x1U<<23)
#define GTZC1_MPCBB2_PRIVCFGR17_PRIV22  (0x1U<<22)
#define GTZC1_MPCBB2_PRIVCFGR17_PRIV21  (0x1U<<21)
#define GTZC1_MPCBB2_PRIVCFGR17_PRIV20  (0x1U<<20)
#define GTZC1_MPCBB2_PRIVCFGR17_PRIV19  (0x1U<<19)
#define GTZC1_MPCBB2_PRIVCFGR17_PRIV18  (0x1U<<18)
#define GTZC1_MPCBB2_PRIVCFGR17_PRIV17  (0x1U<<17)
#define GTZC1_MPCBB2_PRIVCFGR17_PRIV16  (0x1U<<16)
#define GTZC1_MPCBB2_PRIVCFGR17_PRIV15  (0x1U<<15)
#define GTZC1_MPCBB2_PRIVCFGR17_PRIV14  (0x1U<<14)
#define GTZC1_MPCBB2_PRIVCFGR17_PRIV13  (0x1U<<13)
#define GTZC1_MPCBB2_PRIVCFGR17_PRIV12  (0x1U<<12)
#define GTZC1_MPCBB2_PRIVCFGR17_PRIV11  (0x1U<<11)
#define GTZC1_MPCBB2_PRIVCFGR17_PRIV10  (0x1U<<10)
#define GTZC1_MPCBB2_PRIVCFGR17_PRIV9   (0x1U<<9)
#define GTZC1_MPCBB2_PRIVCFGR17_PRIV8   (0x1U<<8)
#define GTZC1_MPCBB2_PRIVCFGR17_PRIV7   (0x1U<<7)
#define GTZC1_MPCBB2_PRIVCFGR17_PRIV6   (0x1U<<6)
#define GTZC1_MPCBB2_PRIVCFGR17_PRIV5   (0x1U<<5)
#define GTZC1_MPCBB2_PRIVCFGR17_PRIV4   (0x1U<<4)
#define GTZC1_MPCBB2_PRIVCFGR17_PRIV3   (0x1U<<3)
#define GTZC1_MPCBB2_PRIVCFGR17_PRIV2   (0x1U<<2)
#define GTZC1_MPCBB2_PRIVCFGR17_PRIV1   (0x1U<<1)
#define GTZC1_MPCBB2_PRIVCFGR17_PRIV0   (0x1U<<0)

// PRIVCFGR18 Configuration

#define GTZC1_MPCBB2_PRIVCFGR18_PRIV31  (0x1U<<31)
#define GTZC1_MPCBB2_PRIVCFGR18_PRIV30  (0x1U<<30)
#define GTZC1_MPCBB2_PRIVCFGR18_PRIV29  (0x1U<<29)
#define GTZC1_MPCBB2_PRIVCFGR18_PRIV28  (0x1U<<28)
#define GTZC1_MPCBB2_PRIVCFGR18_PRIV27  (0x1U<<27)
#define GTZC1_MPCBB2_PRIVCFGR18_PRIV26  (0x1U<<26)
#define GTZC1_MPCBB2_PRIVCFGR18_PRIV25  (0x1U<<25)
#define GTZC1_MPCBB2_PRIVCFGR18_PRIV24  (0x1U<<24)
#define GTZC1_MPCBB2_PRIVCFGR18_PRIV23  (0x1U<<23)
#define GTZC1_MPCBB2_PRIVCFGR18_PRIV22  (0x1U<<22)
#define GTZC1_MPCBB2_PRIVCFGR18_PRIV21  (0x1U<<21)
#define GTZC1_MPCBB2_PRIVCFGR18_PRIV20  (0x1U<<20)
#define GTZC1_MPCBB2_PRIVCFGR18_PRIV19  (0x1U<<19)
#define GTZC1_MPCBB2_PRIVCFGR18_PRIV18  (0x1U<<18)
#define GTZC1_MPCBB2_PRIVCFGR18_PRIV17  (0x1U<<17)
#define GTZC1_MPCBB2_PRIVCFGR18_PRIV16  (0x1U<<16)
#define GTZC1_MPCBB2_PRIVCFGR18_PRIV15  (0x1U<<15)
#define GTZC1_MPCBB2_PRIVCFGR18_PRIV14  (0x1U<<14)
#define GTZC1_MPCBB2_PRIVCFGR18_PRIV13  (0x1U<<13)
#define GTZC1_MPCBB2_PRIVCFGR18_PRIV12  (0x1U<<12)
#define GTZC1_MPCBB2_PRIVCFGR18_PRIV11  (0x1U<<11)
#define GTZC1_MPCBB2_PRIVCFGR18_PRIV10  (0x1U<<10)
#define GTZC1_MPCBB2_PRIVCFGR18_PRIV9   (0x1U<<9)
#define GTZC1_MPCBB2_PRIVCFGR18_PRIV8   (0x1U<<8)
#define GTZC1_MPCBB2_PRIVCFGR18_PRIV7   (0x1U<<7)
#define GTZC1_MPCBB2_PRIVCFGR18_PRIV6   (0x1U<<6)
#define GTZC1_MPCBB2_PRIVCFGR18_PRIV5   (0x1U<<5)
#define GTZC1_MPCBB2_PRIVCFGR18_PRIV4   (0x1U<<4)
#define GTZC1_MPCBB2_PRIVCFGR18_PRIV3   (0x1U<<3)
#define GTZC1_MPCBB2_PRIVCFGR18_PRIV2   (0x1U<<2)
#define GTZC1_MPCBB2_PRIVCFGR18_PRIV1   (0x1U<<1)
#define GTZC1_MPCBB2_PRIVCFGR18_PRIV0   (0x1U<<0)

// PRIVCFGR19 Configuration

#define GTZC1_MPCBB2_PRIVCFGR19_PRIV31  (0x1U<<31)
#define GTZC1_MPCBB2_PRIVCFGR19_PRIV30  (0x1U<<30)
#define GTZC1_MPCBB2_PRIVCFGR19_PRIV29  (0x1U<<29)
#define GTZC1_MPCBB2_PRIVCFGR19_PRIV28  (0x1U<<28)
#define GTZC1_MPCBB2_PRIVCFGR19_PRIV27  (0x1U<<27)
#define GTZC1_MPCBB2_PRIVCFGR19_PRIV26  (0x1U<<26)
#define GTZC1_MPCBB2_PRIVCFGR19_PRIV25  (0x1U<<25)
#define GTZC1_MPCBB2_PRIVCFGR19_PRIV24  (0x1U<<24)
#define GTZC1_MPCBB2_PRIVCFGR19_PRIV23  (0x1U<<23)
#define GTZC1_MPCBB2_PRIVCFGR19_PRIV22  (0x1U<<22)
#define GTZC1_MPCBB2_PRIVCFGR19_PRIV21  (0x1U<<21)
#define GTZC1_MPCBB2_PRIVCFGR19_PRIV20  (0x1U<<20)
#define GTZC1_MPCBB2_PRIVCFGR19_PRIV19  (0x1U<<19)
#define GTZC1_MPCBB2_PRIVCFGR19_PRIV18  (0x1U<<18)
#define GTZC1_MPCBB2_PRIVCFGR19_PRIV17  (0x1U<<17)
#define GTZC1_MPCBB2_PRIVCFGR19_PRIV16  (0x1U<<16)
#define GTZC1_MPCBB2_PRIVCFGR19_PRIV15  (0x1U<<15)
#define GTZC1_MPCBB2_PRIVCFGR19_PRIV14  (0x1U<<14)
#define GTZC1_MPCBB2_PRIVCFGR19_PRIV13  (0x1U<<13)
#define GTZC1_MPCBB2_PRIVCFGR19_PRIV12  (0x1U<<12)
#define GTZC1_MPCBB2_PRIVCFGR19_PRIV11  (0x1U<<11)
#define GTZC1_MPCBB2_PRIVCFGR19_PRIV10  (0x1U<<10)
#define GTZC1_MPCBB2_PRIVCFGR19_PRIV9   (0x1U<<9)
#define GTZC1_MPCBB2_PRIVCFGR19_PRIV8   (0x1U<<8)
#define GTZC1_MPCBB2_PRIVCFGR19_PRIV7   (0x1U<<7)
#define GTZC1_MPCBB2_PRIVCFGR19_PRIV6   (0x1U<<6)
#define GTZC1_MPCBB2_PRIVCFGR19_PRIV5   (0x1U<<5)
#define GTZC1_MPCBB2_PRIVCFGR19_PRIV4   (0x1U<<4)
#define GTZC1_MPCBB2_PRIVCFGR19_PRIV3   (0x1U<<3)
#define GTZC1_MPCBB2_PRIVCFGR19_PRIV2   (0x1U<<2)
#define GTZC1_MPCBB2_PRIVCFGR19_PRIV1   (0x1U<<1)
#define GTZC1_MPCBB2_PRIVCFGR19_PRIV0   (0x1U<<0)

// PRIVCFGR20 Configuration

#define GTZC1_MPCBB2_PRIVCFGR20_PRIV31  (0x1U<<31)
#define GTZC1_MPCBB2_PRIVCFGR20_PRIV30  (0x1U<<30)
#define GTZC1_MPCBB2_PRIVCFGR20_PRIV29  (0x1U<<29)
#define GTZC1_MPCBB2_PRIVCFGR20_PRIV28  (0x1U<<28)
#define GTZC1_MPCBB2_PRIVCFGR20_PRIV27  (0x1U<<27)
#define GTZC1_MPCBB2_PRIVCFGR20_PRIV26  (0x1U<<26)
#define GTZC1_MPCBB2_PRIVCFGR20_PRIV25  (0x1U<<25)
#define GTZC1_MPCBB2_PRIVCFGR20_PRIV24  (0x1U<<24)
#define GTZC1_MPCBB2_PRIVCFGR20_PRIV23  (0x1U<<23)
#define GTZC1_MPCBB2_PRIVCFGR20_PRIV22  (0x1U<<22)
#define GTZC1_MPCBB2_PRIVCFGR20_PRIV21  (0x1U<<21)
#define GTZC1_MPCBB2_PRIVCFGR20_PRIV20  (0x1U<<20)
#define GTZC1_MPCBB2_PRIVCFGR20_PRIV19  (0x1U<<19)
#define GTZC1_MPCBB2_PRIVCFGR20_PRIV18  (0x1U<<18)
#define GTZC1_MPCBB2_PRIVCFGR20_PRIV17  (0x1U<<17)
#define GTZC1_MPCBB2_PRIVCFGR20_PRIV16  (0x1U<<16)
#define GTZC1_MPCBB2_PRIVCFGR20_PRIV15  (0x1U<<15)
#define GTZC1_MPCBB2_PRIVCFGR20_PRIV14  (0x1U<<14)
#define GTZC1_MPCBB2_PRIVCFGR20_PRIV13  (0x1U<<13)
#define GTZC1_MPCBB2_PRIVCFGR20_PRIV12  (0x1U<<12)
#define GTZC1_MPCBB2_PRIVCFGR20_PRIV11  (0x1U<<11)
#define GTZC1_MPCBB2_PRIVCFGR20_PRIV10  (0x1U<<10)
#define GTZC1_MPCBB2_PRIVCFGR20_PRIV9   (0x1U<<9)
#define GTZC1_MPCBB2_PRIVCFGR20_PRIV8   (0x1U<<8)
#define GTZC1_MPCBB2_PRIVCFGR20_PRIV7   (0x1U<<7)
#define GTZC1_MPCBB2_PRIVCFGR20_PRIV6   (0x1U<<6)
#define GTZC1_MPCBB2_PRIVCFGR20_PRIV5   (0x1U<<5)
#define GTZC1_MPCBB2_PRIVCFGR20_PRIV4   (0x1U<<4)
#define GTZC1_MPCBB2_PRIVCFGR20_PRIV3   (0x1U<<3)
#define GTZC1_MPCBB2_PRIVCFGR20_PRIV2   (0x1U<<2)
#define GTZC1_MPCBB2_PRIVCFGR20_PRIV1   (0x1U<<1)
#define GTZC1_MPCBB2_PRIVCFGR20_PRIV0   (0x1U<<0)

// PRIVCFGR21 Configuration

