Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32U5G9/Includes/Registers/stm32U5Gx_gtzc1_mpcbb2.h
#define GTZC1_MPCBB2_PRIVCFGR21_PRIV31  (0x1U<<31)
#define GTZC1_MPCBB2_PRIVCFGR21_PRIV30  (0x1U<<30)
#define GTZC1_MPCBB2_PRIVCFGR21_PRIV29  (0x1U<<29)
#define GTZC1_MPCBB2_PRIVCFGR21_PRIV28  (0x1U<<28)
#define GTZC1_MPCBB2_PRIVCFGR21_PRIV27  (0x1U<<27)
#define GTZC1_MPCBB2_PRIVCFGR21_PRIV26  (0x1U<<26)
#define GTZC1_MPCBB2_PRIVCFGR21_PRIV25  (0x1U<<25)
#define GTZC1_MPCBB2_PRIVCFGR21_PRIV24  (0x1U<<24)
#define GTZC1_MPCBB2_PRIVCFGR21_PRIV23  (0x1U<<23)
#define GTZC1_MPCBB2_PRIVCFGR21_PRIV22  (0x1U<<22)
#define GTZC1_MPCBB2_PRIVCFGR21_PRIV21  (0x1U<<21)
#define GTZC1_MPCBB2_PRIVCFGR21_PRIV20  (0x1U<<20)
#define GTZC1_MPCBB2_PRIVCFGR21_PRIV19  (0x1U<<19)
#define GTZC1_MPCBB2_PRIVCFGR21_PRIV18  (0x1U<<18)
#define GTZC1_MPCBB2_PRIVCFGR21_PRIV17  (0x1U<<17)
#define GTZC1_MPCBB2_PRIVCFGR21_PRIV16  (0x1U<<16)
#define GTZC1_MPCBB2_PRIVCFGR21_PRIV15  (0x1U<<15)
#define GTZC1_MPCBB2_PRIVCFGR21_PRIV14  (0x1U<<14)
#define GTZC1_MPCBB2_PRIVCFGR21_PRIV13  (0x1U<<13)
#define GTZC1_MPCBB2_PRIVCFGR21_PRIV12  (0x1U<<12)
#define GTZC1_MPCBB2_PRIVCFGR21_PRIV11  (0x1U<<11)
#define GTZC1_MPCBB2_PRIVCFGR21_PRIV10  (0x1U<<10)
#define GTZC1_MPCBB2_PRIVCFGR21_PRIV9   (0x1U<<9)
#define GTZC1_MPCBB2_PRIVCFGR21_PRIV8   (0x1U<<8)
#define GTZC1_MPCBB2_PRIVCFGR21_PRIV7   (0x1U<<7)
#define GTZC1_MPCBB2_PRIVCFGR21_PRIV6   (0x1U<<6)
#define GTZC1_MPCBB2_PRIVCFGR21_PRIV5   (0x1U<<5)
#define GTZC1_MPCBB2_PRIVCFGR21_PRIV4   (0x1U<<4)
#define GTZC1_MPCBB2_PRIVCFGR21_PRIV3   (0x1U<<3)
#define GTZC1_MPCBB2_PRIVCFGR21_PRIV2   (0x1U<<2)
#define GTZC1_MPCBB2_PRIVCFGR21_PRIV1   (0x1U<<1)
#define GTZC1_MPCBB2_PRIVCFGR21_PRIV0   (0x1U<<0)

// PRIVCFGR22 Configuration

#define GTZC1_MPCBB2_PRIVCFGR22_PRIV31  (0x1U<<31)
#define GTZC1_MPCBB2_PRIVCFGR22_PRIV30  (0x1U<<30)
#define GTZC1_MPCBB2_PRIVCFGR22_PRIV29  (0x1U<<29)
#define GTZC1_MPCBB2_PRIVCFGR22_PRIV28  (0x1U<<28)
#define GTZC1_MPCBB2_PRIVCFGR22_PRIV27  (0x1U<<27)
#define GTZC1_MPCBB2_PRIVCFGR22_PRIV26  (0x1U<<26)
#define GTZC1_MPCBB2_PRIVCFGR22_PRIV25  (0x1U<<25)
#define GTZC1_MPCBB2_PRIVCFGR22_PRIV24  (0x1U<<24)
#define GTZC1_MPCBB2_PRIVCFGR22_PRIV23  (0x1U<<23)
#define GTZC1_MPCBB2_PRIVCFGR22_PRIV22  (0x1U<<22)
#define GTZC1_MPCBB2_PRIVCFGR22_PRIV21  (0x1U<<21)
#define GTZC1_MPCBB2_PRIVCFGR22_PRIV20  (0x1U<<20)
#define GTZC1_MPCBB2_PRIVCFGR22_PRIV19  (0x1U<<19)
#define GTZC1_MPCBB2_PRIVCFGR22_PRIV18  (0x1U<<18)
#define GTZC1_MPCBB2_PRIVCFGR22_PRIV17  (0x1U<<17)
#define GTZC1_MPCBB2_PRIVCFGR22_PRIV16  (0x1U<<16)
#define GTZC1_MPCBB2_PRIVCFGR22_PRIV15  (0x1U<<15)
#define GTZC1_MPCBB2_PRIVCFGR22_PRIV14  (0x1U<<14)
#define GTZC1_MPCBB2_PRIVCFGR22_PRIV13  (0x1U<<13)
#define GTZC1_MPCBB2_PRIVCFGR22_PRIV12  (0x1U<<12)
#define GTZC1_MPCBB2_PRIVCFGR22_PRIV11  (0x1U<<11)
#define GTZC1_MPCBB2_PRIVCFGR22_PRIV10  (0x1U<<10)
#define GTZC1_MPCBB2_PRIVCFGR22_PRIV9   (0x1U<<9)
#define GTZC1_MPCBB2_PRIVCFGR22_PRIV8   (0x1U<<8)
#define GTZC1_MPCBB2_PRIVCFGR22_PRIV7   (0x1U<<7)
#define GTZC1_MPCBB2_PRIVCFGR22_PRIV6   (0x1U<<6)
#define GTZC1_MPCBB2_PRIVCFGR22_PRIV5   (0x1U<<5)
#define GTZC1_MPCBB2_PRIVCFGR22_PRIV4   (0x1U<<4)
#define GTZC1_MPCBB2_PRIVCFGR22_PRIV3   (0x1U<<3)
#define GTZC1_MPCBB2_PRIVCFGR22_PRIV2   (0x1U<<2)
#define GTZC1_MPCBB2_PRIVCFGR22_PRIV1   (0x1U<<1)
#define GTZC1_MPCBB2_PRIVCFGR22_PRIV0   (0x1U<<0)

// PRIVCFGR23 Configuration

#define GTZC1_MPCBB2_PRIVCFGR23_PRIV31  (0x1U<<31)
#define GTZC1_MPCBB2_PRIVCFGR23_PRIV30  (0x1U<<30)
#define GTZC1_MPCBB2_PRIVCFGR23_PRIV29  (0x1U<<29)
#define GTZC1_MPCBB2_PRIVCFGR23_PRIV28  (0x1U<<28)
#define GTZC1_MPCBB2_PRIVCFGR23_PRIV27  (0x1U<<27)
#define GTZC1_MPCBB2_PRIVCFGR23_PRIV26  (0x1U<<26)
#define GTZC1_MPCBB2_PRIVCFGR23_PRIV25  (0x1U<<25)
#define GTZC1_MPCBB2_PRIVCFGR23_PRIV24  (0x1U<<24)
#define GTZC1_MPCBB2_PRIVCFGR23_PRIV23  (0x1U<<23)
#define GTZC1_MPCBB2_PRIVCFGR23_PRIV22  (0x1U<<22)
#define GTZC1_MPCBB2_PRIVCFGR23_PRIV21  (0x1U<<21)
#define GTZC1_MPCBB2_PRIVCFGR23_PRIV20  (0x1U<<20)
#define GTZC1_MPCBB2_PRIVCFGR23_PRIV19  (0x1U<<19)
#define GTZC1_MPCBB2_PRIVCFGR23_PRIV18  (0x1U<<18)
#define GTZC1_MPCBB2_PRIVCFGR23_PRIV17  (0x1U<<17)
#define GTZC1_MPCBB2_PRIVCFGR23_PRIV16  (0x1U<<16)
#define GTZC1_MPCBB2_PRIVCFGR23_PRIV15  (0x1U<<15)
#define GTZC1_MPCBB2_PRIVCFGR23_PRIV14  (0x1U<<14)
#define GTZC1_MPCBB2_PRIVCFGR23_PRIV13  (0x1U<<13)
#define GTZC1_MPCBB2_PRIVCFGR23_PRIV12  (0x1U<<12)
#define GTZC1_MPCBB2_PRIVCFGR23_PRIV11  (0x1U<<11)
#define GTZC1_MPCBB2_PRIVCFGR23_PRIV10  (0x1U<<10)
#define GTZC1_MPCBB2_PRIVCFGR23_PRIV9   (0x1U<<9)
#define GTZC1_MPCBB2_PRIVCFGR23_PRIV8   (0x1U<<8)
#define GTZC1_MPCBB2_PRIVCFGR23_PRIV7   (0x1U<<7)
#define GTZC1_MPCBB2_PRIVCFGR23_PRIV6   (0x1U<<6)
#define GTZC1_MPCBB2_PRIVCFGR23_PRIV5   (0x1U<<5)
#define GTZC1_MPCBB2_PRIVCFGR23_PRIV4   (0x1U<<4)
#define GTZC1_MPCBB2_PRIVCFGR23_PRIV3   (0x1U<<3)
#define GTZC1_MPCBB2_PRIVCFGR23_PRIV2   (0x1U<<2)
#define GTZC1_MPCBB2_PRIVCFGR23_PRIV1   (0x1U<<1)
#define GTZC1_MPCBB2_PRIVCFGR23_PRIV0   (0x1U<<0)

// PRIVCFGR24 Configuration

#define GTZC1_MPCBB2_PRIVCFGR24_PRIV31  (0x1U<<31)
#define GTZC1_MPCBB2_PRIVCFGR24_PRIV30  (0x1U<<30)
#define GTZC1_MPCBB2_PRIVCFGR24_PRIV29  (0x1U<<29)
#define GTZC1_MPCBB2_PRIVCFGR24_PRIV28  (0x1U<<28)
#define GTZC1_MPCBB2_PRIVCFGR24_PRIV27  (0x1U<<27)
#define GTZC1_MPCBB2_PRIVCFGR24_PRIV26  (0x1U<<26)
#define GTZC1_MPCBB2_PRIVCFGR24_PRIV25  (0x1U<<25)
#define GTZC1_MPCBB2_PRIVCFGR24_PRIV24  (0x1U<<24)
#define GTZC1_MPCBB2_PRIVCFGR24_PRIV23  (0x1U<<23)
#define GTZC1_MPCBB2_PRIVCFGR24_PRIV22  (0x1U<<22)
#define GTZC1_MPCBB2_PRIVCFGR24_PRIV21  (0x1U<<21)
#define GTZC1_MPCBB2_PRIVCFGR24_PRIV20  (0x1U<<20)
#define GTZC1_MPCBB2_PRIVCFGR24_PRIV19  (0x1U<<19)
#define GTZC1_MPCBB2_PRIVCFGR24_PRIV18  (0x1U<<18)
#define GTZC1_MPCBB2_PRIVCFGR24_PRIV17  (0x1U<<17)
#define GTZC1_MPCBB2_PRIVCFGR24_PRIV16  (0x1U<<16)
#define GTZC1_MPCBB2_PRIVCFGR24_PRIV15  (0x1U<<15)
#define GTZC1_MPCBB2_PRIVCFGR24_PRIV14  (0x1U<<14)
#define GTZC1_MPCBB2_PRIVCFGR24_PRIV13  (0x1U<<13)
#define GTZC1_MPCBB2_PRIVCFGR24_PRIV12  (0x1U<<12)
#define GTZC1_MPCBB2_PRIVCFGR24_PRIV11  (0x1U<<11)
#define GTZC1_MPCBB2_PRIVCFGR24_PRIV10  (0x1U<<10)
#define GTZC1_MPCBB2_PRIVCFGR24_PRIV9   (0x1U<<9)
#define GTZC1_MPCBB2_PRIVCFGR24_PRIV8   (0x1U<<8)
#define GTZC1_MPCBB2_PRIVCFGR24_PRIV7   (0x1U<<7)
#define GTZC1_MPCBB2_PRIVCFGR24_PRIV6   (0x1U<<6)
#define GTZC1_MPCBB2_PRIVCFGR24_PRIV5   (0x1U<<5)
#define GTZC1_MPCBB2_PRIVCFGR24_PRIV4   (0x1U<<4)
#define GTZC1_MPCBB2_PRIVCFGR24_PRIV3   (0x1U<<3)
#define GTZC1_MPCBB2_PRIVCFGR24_PRIV2   (0x1U<<2)
#define GTZC1_MPCBB2_PRIVCFGR24_PRIV1   (0x1U<<1)
#define GTZC1_MPCBB2_PRIVCFGR24_PRIV0   (0x1U<<0)

